t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_hrpwm.h
#define HRPWM_O_XCMPCTL1         0x0U    // XCMP Mode Control Register
#define HRPWM_O_XLOADCTL         0x8U    // XCMP Mode Load Control Register
#define HRPWM_O_XLOAD            0xCU    // XCMP Mode Load Enable Register
#define HRPWM_O_EPWMXLINKXLOAD   0xEU    // Link register across PWM modules
#define HRPWM_O_XREGSHDW1STS     0x10U   // Shadow Buffer 1 Update Status Register
#define HRPWM_O_XREGSHDW2STS     0x14U   // Shadow Buffer 2 Update Status Register
#define HRPWM_O_XREGSHDW3STS     0x18U   // Shadow Buffer 3 Update Status Register
#define HRPWM_O_XCMP1_ACTIVE     0x20U   // Additional Compare 1 Active Register
#define HRPWM_O_XCMP2_ACTIVE     0x22U   // Additional Compare 2 Active Register
#define HRPWM_O_XCMP3_ACTIVE     0x24U   // Additional Compare 3 Active Register
#define HRPWM_O_XCMP4_ACTIVE     0x26U   // Additional Compare 4 Active Register
#define HRPWM_O_XCMP5_ACTIVE     0x28U   // Additional Compare 5 Active Register
#define HRPWM_O_XCMP6_ACTIVE     0x2AU   // Additional Compare 6 Active Register
#define HRPWM_O_XCMP7_ACTIVE     0x2CU   // Additional Compare 7 Active Register
#define HRPWM_O_XCMP8_ACTIVE     0x2EU   // Additional Compare 8 Active Register
#define HRPWM_O_XTBPRD_ACTIVE    0x30U   // Additional Time Base Period Active Register
#define HRPWM_O_XAQCTLA_ACTIVE   0x34U   // AQCTLA Active Register
#define HRPWM_O_XAQCTLB_ACTIVE   0x35U   // AQCTLB Active Register
#define HRPWM_O_XMINMAX_ACTIVE   0x3EU   // XMINMAX Active Register
#define HRPWM_O_XCMP1_SHDW1      0x40U   // Additional Compare 1 Shadow 1 Register
#define HRPWM_O_XCMP2_SHDW1      0x42U   // Additional Compare 2 Shadow 1 Register
#define HRPWM_O_XCMP3_SHDW1      0x44U   // Additional Compare 3 Shadow 1 Register
#define HRPWM_O_XCMP4_SHDW1      0x46U   // Additional Compare 4 Shadow 1 Register
#define HRPWM_O_XCMP5_SHDW1      0x48U   // Additional Compare 5 Shadow 1 Register
#define HRPWM_O_XCMP6_SHDW1      0x4AU   // Additional Compare 6 Shadow 1 Register
#define HRPWM_O_XCMP7_SHDW1      0x4CU   // Additional Compare 7 Shadow 1 Register
#define HRPWM_O_XCMP8_SHDW1      0x4EU   // Additional Compare 8 Shadow 1 Register
#define HRPWM_O_XTBPRD_SHDW1     0x50U   // Additional Time Base Period Shadow 1 Register
#define HRPWM_O_XAQCTLA_SHDW1    0x54U   // XAQCTLA Shadow 1 Register
#define HRPWM_O_XAQCTLB_SHDW1    0x55U   // XAQCTLB Shadow 1 Register
#define HRPWM_O_CMPC_SHDW1       0x57U   // CMPC Shadow 1 Register
#define HRPWM_O_CMPD_SHDW1       0x59U   // CMPD Shadow 1 Register
#define HRPWM_O_XMINMAX_SHDW1    0x5EU   // XMINMAX Shadow 1 Register
#define HRPWM_O_XCMP1_SHDW2      0x60U   // Additional Compare 1 Shadow 2 Register
#define HRPWM_O_XCMP2_SHDW2      0x62U   // Additional Compare 2 Shadow 2 Register
#define HRPWM_O_XCMP3_SHDW2      0x64U   // Additional Compare 3 Shadow 2 Register
#define HRPWM_O_XCMP4_SHDW2      0x66U   // Additional Compare 4 Shadow 2 Register
#define HRPWM_O_XCMP5_SHDW2      0x68U   // Additional Compare 5 Shadow 2 Register
#define HRPWM_O_XCMP6_SHDW2      0x6AU   // Additional Compare 6 Shadow 2 Register
#define HRPWM_O_XCMP7_SHDW2      0x6CU   // Additional Compare 7 Shadow 2 Register
#define HRPWM_O_XCMP8_SHDW2      0x6EU   // Additional Compare 8 Shadow 2 Register
#define HRPWM_O_XTBPRD_SHDW2     0x70U   // Additional Time Base Period Shadow 2 Register
#define HRPWM_O_XAQCTLA_SHDW2    0x74U   // XAQCTLA Shadow 2 Register
#define HRPWM_O_XAQCTLB_SHDW2    0x75U   // XAQCTLB Shadow 2 Register
#define HRPWM_O_CMPC_SHDW2       0x77U   // CMPC Shadow 2 Register
#define HRPWM_O_CMPD_SHDW2       0x79U   // CMPD Shadow 2 Register
#define HRPWM_O_XMINMAX_SHDW2    0x7EU   // XMINMAX Shadow 2 Register
#define HRPWM_O_XCMP1_SHDW3      0x80U   // Additional Compare 1 Shadow 3 Register
#define HRPWM_O_XCMP2_SHDW3      0x82U   // Additional Compare 2 Shadow 3 Register
#define HRPWM_O_XCMP3_SHDW3      0x84U   // Additional Compare 3 Shadow 3 Register
#define HRPWM_O_XCMP4_SHDW3      0x86U   // Additional Compare 4 Shadow 3 Register
#define HRPWM_O_XCMP5_SHDW3      0x88U   // Additional Compare 5 Shadow 3 Register
#define HRPWM_O_XCMP6_SHDW3      0x8AU   // Additional Compare 6 Shadow 3 Register
#define HRPWM_O_XCMP7_SHDW3      0x8CU   // Additional Compare 7 Shadow 3 Register
#define HRPWM_O_XCMP8_SHDW3      0x8EU   // Additional Compare 8 Shadow 3 Register
#define HRPWM_O_XTBPRD_SHDW3     0x90U   // Additional Time Base Period Shadow 3 Register
#define HRPWM_O_XAQCTLA_SHDW3    0x94U   // XAQCTLA Shadow 3 Register
#define HRPWM_O_XAQCTLB_SHDW3    0x95U   // XAQCTLB Shadow 3 Register
#define HRPWM_O_CMPC_SHDW3       0x97U   // CMPC Shadow 3 Register
#define HRPWM_O_CMPD_SHDW3       0x99U   // CMPD Shadow 3 Register
#define HRPWM_O_XMINMAX_SHDW3    0x9EU   // XMINMAX Shadow 3 Register

#define HRPWM_O_DECTL        0x0U    // DE control register
#define HRPWM_O_DECOMPSEL    0x2U    // DE comparator source select register
#define HRPWM_O_DEACTCTL     0x4U    // DE Action Control
#define HRPWM_O_DESTS        0x6U    // DE Status register
#define HRPWM_O_DEFRC        0x8U    // DE Status force register
#define HRPWM_O_DECLR        0xAU    // DE Status clear register
#define HRPWM_O_DEMONCNT     0x10U   // DE trip monitor counter
#define HRPWM_O_DEMONCTL     0x12U   // DE monitor mode control
#define HRPWM_O_DEMONSTEP    0x14U   // DE monitor counter step
#define HRPWM_O_DEMONTHRES   0x16U   // DE monitor counter threshold

#define HRPWM_O_MINDBCFG   0x0U    // Minimum dead band configuration register.
#define HRPWM_O_MINDBDLY   0x2U    // Minimum dead band delay register
#define HRPWM_O_LUTCTLA    0x10U   // LUT control register on PWMA
#define HRPWM_O_LUTCTLB    0x12U   // LUT control register on PWMB


//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL register
//
//*************************************************************************************************
#define HRPWM_TBCTL_CTRMODE_S     0U
#define HRPWM_TBCTL_CTRMODE_M     0x3U      // Counter Mode
#define HRPWM_TBCTL_PHSEN         0x4U      // Phase Load Enable
#define HRPWM_TBCTL_PRDLD         0x8U      // Active Period Load
#define HRPWM_TBCTL_SWFSYNC       0x40U     // Software Force Sync Pulse
#define HRPWM_TBCTL_HSPCLKDIV_S   7U
#define HRPWM_TBCTL_HSPCLKDIV_M   0x380U    // High Speed TBCLK Pre-scaler
#define HRPWM_TBCTL_CLKDIV_S      10U
#define HRPWM_TBCTL_CLKDIV_M      0x1C00U   // Time Base Clock Pre-scaler
#define HRPWM_TBCTL_PHSDIR        0x2000U   // Phase Direction Bit
#define HRPWM_TBCTL_FREE_SOFT_S   14U
#define HRPWM_TBCTL_FREE_SOFT_M   0xC000U   // Emulation Mode Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL2 register
//
//*************************************************************************************************
#define HRPWM_TBCTL2_OSHTSYNCMODE   0x40U     // One shot sync mode
#define HRPWM_TBCTL2_OSHTSYNC       0x80U     // One shot sync
#define HRPWM_TBCTL2_PRDLDSYNC_S    14U
#define HRPWM_TBCTL2_PRDLDSYNC_M    0xC000U   // PRD Shadow to Active Load on SYNC Event

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMSYNCINSEL register
//
//*************************************************************************************************
#define HRPWM_EPWMSYNCINSEL_SEL_S   0U
#define HRPWM_EPWMSYNCINSEL_SEL_M   0x7FU   // EPWMxSYNCI source select

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBSTS register
//
//*************************************************************************************************
#define HRPWM_TBSTS_CTRDIR   0x1U   // Counter Direction Status
#define HRPWM_TBSTS_SYNCI    0x2U   // External Input Sync Status
#define HRPWM_TBSTS_CTRMAX   0x4U   // Counter Max Latched Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMSYNCOUTEN register
//
//*************************************************************************************************
#define HRPWM_EPWMSYNCOUTEN_SWEN        0x1U    // EPWMxSYNCO Software Force Enable
#define HRPWM_EPWMSYNCOUTEN_ZEROEN      0x2U    // EPWMxSYNCO Zero Count Event Enable
#define HRPWM_EPWMSYNCOUTEN_CMPBEN      0x4U    // EPWMxSYNCO Compare B Event Enable
#define HRPWM_EPWMSYNCOUTEN_CMPCEN      0x8U    // EPWMxSYNCO Compare C Event Enable
#define HRPWM_EPWMSYNCOUTEN_CMPDEN      0x10U   // EPWMxSYNCO Compare D Event Enable
#define HRPWM_EPWMSYNCOUTEN_DCAEVT1EN   0x20U   // EPWMxSYNCO Digital Compare A Event 1 Sync Enable
#define HRPWM_EPWMSYNCOUTEN_DCBEVT1EN   0x40U   // EPWMxSYNCO Digital Compare B Event 1 Sync Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL3 register
//
//*************************************************************************************************
#define HRPWM_TBCTL3_OSSFRCEN   0x1U   // One Shot Sync Force Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPCTL register
//
//*************************************************************************************************
#define HRPWM_CMPCTL_LOADAMODE_S   0U
#define HRPWM_CMPCTL_LOADAMODE_M   0x3U      // Active Compare A Load
#define HRPWM_CMPCTL_LOADBMODE_S   2U
#define HRPWM_CMPCTL_LOADBMODE_M   0xCU      // Active Compare B Load
#define HRPWM_CMPCTL_SHDWAMODE     0x10U     // Compare A Register Block Operating Mode
#define HRPWM_CMPCTL_SHDWBMODE     0x40U     // Compare B Register Block Operating Mode
#define HRPWM_CMPCTL_SHDWAFULL     0x100U    // Compare A Shadow Register Full Status
#define HRPWM_CMPCTL_SHDWBFULL     0x200U    // Compare B Shadow Register Full Status
#define HRPWM_CMPCTL_LOADASYNC_S   10U
#define HRPWM_CMPCTL_LOADASYNC_M   0xC00U    // Active Compare A Load on SYNC
#define HRPWM_CMPCTL_LOADBSYNC_S   12U
#define HRPWM_CMPCTL_LOADBSYNC_M   0x3000U   // Active Compare B Load on SYNC
#define HRPWM_CMPCTL_LINKDUTYHR    0x8000U   // Enable same values on CMPAHR/CMPBHR

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPCTL2 register
//
//*************************************************************************************************
#define HRPWM_CMPCTL2_LOADCMODE_S   0U
#define HRPWM_CMPCTL2_LOADCMODE_M   0x3U      // Active Compare C Load
#define HRPWM_CMPCTL2_LOADDMODE_S   2U
#define HRPWM_CMPCTL2_LOADDMODE_M   0xCU      // Active Compare D load
#define HRPWM_CMPCTL2_SHDWCMODE     0x10U     // Compare C Block Operating Mode
#define HRPWM_CMPCTL2_SHDWDMODE     0x40U     // Compare D Block Operating Mode
#define HRPWM_CMPCTL2_LOADCSYNC_S   10U
#define HRPWM_CMPCTL2_LOADCSYNC_M   0xC00U    // Active Compare C Load on SYNC
#define HRPWM_CMPCTL2_LOADDSYNC_S   12U
#define HRPWM_CMPCTL2_LOADDSYNC_M   0x3000U   // Active Compare D Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBCTL register
//
//*************************************************************************************************
#define HRPWM_DBCTL_OUT_MODE_S      0U
#define HRPWM_DBCTL_OUT_MODE_M      0x3U      // Dead Band Output Mode Control
#define HRPWM_DBCTL_POLSEL_S        2U
#define HRPWM_DBCTL_POLSEL_M        0xCU      // Polarity Select Control
#define HRPWM_DBCTL_IN_MODE_S       4U
#define HRPWM_DBCTL_IN_MODE_M       0x30U     // Dead Band Input Select Mode Control
#define HRPWM_DBCTL_LOADREDMODE_S   6U
#define HRPWM_DBCTL_LOADREDMODE_M   0xC0U     // Active DBRED Load Mode
#define HRPWM_DBCTL_LOADFEDMODE_S   8U
#define HRPWM_DBCTL_LOADFEDMODE_M   0x300U    // Active DBFED Load Mode
#define HRPWM_DBCTL_SHDWDBREDMODE   0x400U    // DBRED Block Operating Mode
#define HRPWM_DBCTL_SHDWDBFEDMODE   0x800U    // DBFED Block Operating Mode
#define HRPWM_DBCTL_OUTSWAP_S       12U
#define HRPWM_DBCTL_OUTSWAP_M       0x3000U   // Dead Band Output Swap Control
#define HRPWM_DBCTL_DEDB_MODE       0x4000U   // Dead Band Dual-Edge B Mode Control
#define HRPWM_DBCTL_HALFCYCLE       0x8000U   // Half Cycle Clocking Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBCTL2 register
//
//*************************************************************************************************
#define HRPWM_DBCTL2_LOADDBCTLMODE_S   0U
#define HRPWM_DBCTL2_LOADDBCTLMODE_M   0x3U   // DBCTL Load from Shadow Mode Select
#define HRPWM_DBCTL2_SHDWDBCTLMODE     0x4U   // DBCTL Load mode Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTL register
//
//*************************************************************************************************
#define HRPWM_AQCTL_LDAQAMODE_S   0U
#define HRPWM_AQCTL_LDAQAMODE_M   0x3U     // Action Qualifier A Load Select
#define HRPWM_AQCTL_LDAQBMODE_S   2U
#define HRPWM_AQCTL_LDAQBMODE_M   0xCU     // Action Qualifier B Load Select
#define HRPWM_AQCTL_SHDWAQAMODE   0x10U    // Action Qualifer A Operating Mode
#define HRPWM_AQCTL_SHDWAQBMODE   0x40U    // Action Qualifier B Operating Mode
#define HRPWM_AQCTL_LDAQASYNC_S   8U
#define HRPWM_AQCTL_LDAQASYNC_M   0x300U   // AQCTLA Register Load on SYNC
#define HRPWM_AQCTL_LDAQBSYNC_S   10U
#define HRPWM_AQCTL_LDAQBSYNC_M   0xC00U   // AQCTLB Register Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQTSRCSEL register
//
//*************************************************************************************************
#define HRPWM_AQTSRCSEL_T1SEL_S   0U
#define HRPWM_AQTSRCSEL_T1SEL_M   0xFU    // T1 Event Source Select Bits
#define HRPWM_AQTSRCSEL_T2SEL_S   4U
#define HRPWM_AQTSRCSEL_T2SEL_M   0xF0U   // T2 Event Source Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCCTL register
//
//*************************************************************************************************
#define HRPWM_PCCTL_CHPEN       0x1U     // PWM chopping enable
#define HRPWM_PCCTL_OSHTWTH_S   1U
#define HRPWM_PCCTL_OSHTWTH_M   0x1EU    // One-shot pulse width
#define HRPWM_PCCTL_CHPFREQ_S   5U
#define HRPWM_PCCTL_CHPFREQ_M   0xE0U    // Chopping clock frequency
#define HRPWM_PCCTL_CHPDUTY_S   8U
#define HRPWM_PCCTL_CHPDUTY_M   0x700U   // Chopping clock Duty cycle

//*************************************************************************************************
//
// The following are defines for the bit fields in the VCAPCTL register
//
//*************************************************************************************************
#define HRPWM_VCAPCTL_VCAPE            0x1U     // Valley  Capture mode
#define HRPWM_VCAPCTL_VCAPSTART        0x2U     // Valley  Capture Start
#define HRPWM_VCAPCTL_TRIGSEL_S        2U
#define HRPWM_VCAPCTL_TRIGSEL_M        0x1CU    // Capture Trigger Select
#define HRPWM_VCAPCTL_VDELAYDIV_S      7U
#define HRPWM_VCAPCTL_VDELAYDIV_M      0x380U   // Valley Delay Mode Divide Enable
#define HRPWM_VCAPCTL_EDGEFILTDLYSEL   0x400U   // Valley Switching Mode Delay Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the VCNTCFG register
//
//*************************************************************************************************
#define HRPWM_VCNTCFG_STARTEDGE_S    0U
#define HRPWM_VCNTCFG_STARTEDGE_M    0xFU      // Counter Start Edge Selection
#define HRPWM_VCNTCFG_STARTEDGESTS   0x80U     // Start Edge Status Bit
#define HRPWM_VCNTCFG_STOPEDGE_S     8U
#define HRPWM_VCNTCFG_STOPEDGE_M     0xF00U    // Counter Start Edge Selection
#define HRPWM_VCNTCFG_STOPEDGESTS    0x8000U   // Stop Edge Status Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCNFG register
//
//*************************************************************************************************
#define HRPWM_HRCNFG_EDGMODE_S    0U
#define HRPWM_HRCNFG_EDGMODE_M    0x3U      // ePWMxA Edge Mode Select Bits
#define HRPWM_HRCNFG_CTLMODE      0x4U      // ePWMxA Control Mode Select Bits
#define HRPWM_HRCNFG_HRLOAD_S     3U
#define HRPWM_HRCNFG_HRLOAD_M     0x18U     // ePWMxA Shadow Mode Select Bits
#define HRPWM_HRCNFG_SELOUTB      0x20U     // EPWMB Output Selection Bit
#define HRPWM_HRCNFG_AUTOCONV     0x40U     // Autoconversion Bit
#define HRPWM_HRCNFG_SWAPAB       0x80U     // Swap EPWMA and EPWMB Outputs Bit
#define HRPWM_HRCNFG_EDGMODEB_S   8U
#define HRPWM_HRCNFG_EDGMODEB_M   0x300U    // ePWMxB Edge Mode Select Bits
#define HRPWM_HRCNFG_CTLMODEB     0x400U    // ePWMxB Control Mode Select Bits
#define HRPWM_HRCNFG_HRLOADB_S    11U
#define HRPWM_HRCNFG_HRLOADB_M    0x1800U   // ePWMxB Shadow Mode Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCNFG2 register
//
//*************************************************************************************************
#define HRPWM_HRCNFG2_EDGMODEDB_S      0U
#define HRPWM_HRCNFG2_EDGMODEDB_M      0x3U    // Dead-Band Edge-Mode Select Bits
#define HRPWM_HRCNFG2_CTLMODEDBRED_S   2U
#define HRPWM_HRCNFG2_CTLMODEDBRED_M   0xCU    // DBRED Control Mode Select Bits
#define HRPWM_HRCNFG2_CTLMODEDBFED_S   4U
#define HRPWM_HRCNFG2_CTLMODEDBFED_M   0x30U   // DBFED Control Mode Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRPCTL register
//
//*************************************************************************************************
#define HRPWM_HRPCTL_HRPE            0x1U    // High Resolution Period Enable
#define HRPWM_HRPCTL_PWMSYNCSEL      0x2U    // EPWMSYNCPER Source Select
#define HRPWM_HRPCTL_TBPHSHRLOADE    0x4U    // TBPHSHR Load Enable
#define HRPWM_HRPCTL_PWMSYNCSELX_S   4U
#define HRPWM_HRPCTL_PWMSYNCSELX_M   0x70U   // EPWMSYNCPER Extended Source Select Bit:

//*************************************************************************************************
//
// The following are defines for the bit fields in the TRREM register
//
//*************************************************************************************************
#define HRPWM_TRREM_TRREM_S   0U
#define HRPWM_TRREM_TRREM_M   0x7FFU   // HRPWM Remainder Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the GLDCTL register
//
//*************************************************************************************************
#define HRPWM_GLDCTL_GLD         0x1U      // Global Shadow to Active load event control
#define HRPWM_GLDCTL_GLDMODE_S   1U
#define HRPWM_GLDCTL_GLDMODE_M   0x1EU     // Shadow to Active Global Load Pulse Selection
#define HRPWM_GLDCTL_OSHTMODE    0x20U     // One Shot Load mode control bit
#define HRPWM_GLDCTL_GLDPRD_S    7U
#define HRPWM_GLDCTL_GLDPRD_M    0x380U    // Global Load Strobe Period Select Register
#define HRPWM_GLDCTL_GLDCNT_S    10U
#define HRPWM_GLDCTL_GLDCNT_M    0x1C00U   // Global Load Strobe Counter Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the GLDCFG register
//
//*************************************************************************************************
#define HRPWM_GLDCFG_TBPRD_TBPRDHR    0x1U     // Global load event configuration for TBPRD:TBPRDHR
#define HRPWM_GLDCFG_CMPA_CMPAHR      0x2U     // Global load event configuration for CMPA:CMPAHR
#define HRPWM_GLDCFG_CMPB_CMPBHR      0x4U     // Global load event configuration for CMPB:CMPBHR
#define HRPWM_GLDCFG_CMPC             0x8U     // Global load event configuration for CMPC
#define HRPWM_GLDCFG_CMPD             0x10U    // Global load event configuration for CMPD
#define HRPWM_GLDCFG_DBRED_DBREDHR    0x20U    // Global load event configuration for DBRED:DBREDHR
#define HRPWM_GLDCFG_DBFED_DBFEDHR    0x40U    // Global load event configuration for DBFED:DBFEDHR
#define HRPWM_GLDCFG_DBCTL            0x80U    // Global load event configuration for DBCTL
#define HRPWM_GLDCFG_AQCTLA_AQCTLA2   0x100U   // Global load event configuration for AQCTLA/A2
#define HRPWM_GLDCFG_AQCTLB_AQCTLB2   0x200U   // Global load event configuration for AQCTLB/B2
#define HRPWM_GLDCFG_AQCSFRC          0x400U   // Global load event configuration for AQCSFRC

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINK register
//
//*************************************************************************************************
#define HRPWM_EPWMXLINK_TBPRDLINK_S     0U
#define HRPWM_EPWMXLINK_TBPRDLINK_M     0x1FU         // TBPRD:TBPRDHR  Link
#define HRPWM_EPWMXLINK_CMPALINK_S      5U
#define HRPWM_EPWMXLINK_CMPALINK_M      0x3E0U        // CMPA:CMPAHR Link
#define HRPWM_EPWMXLINK_CMPBLINK_S      10U
#define HRPWM_EPWMXLINK_CMPBLINK_M      0x7C00U       // CMPB:CMPBHR Link
#define HRPWM_EPWMXLINK_CMPCLINK_S      16U
#define HRPWM_EPWMXLINK_CMPCLINK_M      0x1F0000U     // CMPC Link
#define HRPWM_EPWMXLINK_CMPDLINK_S      21U
#define HRPWM_EPWMXLINK_CMPDLINK_M      0x3E00000U    // CMPD Link
#define HRPWM_EPWMXLINK_GLDCTL2LINK_S   26U
#define HRPWM_EPWMXLINK_GLDCTL2LINK_M   0x7C000000U   // GLDCTL2 Link

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINK2 register
//
//*************************************************************************************************
#define HRPWM_EPWMXLINK2_DBREDLINK_S   0U
#define HRPWM_EPWMXLINK2_DBREDLINK_M   0x1FU    // DBRED:DBREDHR Link
#define HRPWM_EPWMXLINK2_DBFEDLINK_S   5U
#define HRPWM_EPWMXLINK2_DBFEDLINK_M   0x3E0U   // DBFED:DBFEDHR Link

