t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_hrpwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPCTL register
//
//*************************************************************************************************
#define HRPWM_CAPCTL_SRCSEL         0x1U     // Capture Logic Input Selection
#define HRPWM_CAPCTL_CAPGATEPOL_S   1U
#define HRPWM_CAPCTL_CAPGATEPOL_M   0x6U     // Polarity selection for Capture Gate input
#define HRPWM_CAPCTL_CAPINPOL       0x8U     // Polarity selection for Capture input
#define HRPWM_CAPCTL_PULSECTL       0x10U    // Polarity selection for Capture input
#define HRPWM_CAPCTL_FRCLOAD        0x100U   // Capture event force load

//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPGATETRIPSEL register
//
//*************************************************************************************************
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to CAPGATE Mux
#define HRPWM_CAPGATETRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to CAPGATE Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPINTRIPSEL register
//
//*************************************************************************************************
#define HRPWM_CAPINTRIPSEL_TRIPINPUT1    0x1U      // Trip Input 1 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT2    0x2U      // Trip Input 2 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT3    0x4U      // Trip Input 3 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT4    0x8U      // Trip Input 4 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT5    0x10U     // Trip Input 5 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT6    0x20U     // Trip Input 6 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT7    0x40U     // Trip Input 7 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT8    0x80U     // Trip Input 8 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT9    0x100U    // Trip Input 9 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT10   0x200U    // Trip Input 10 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT11   0x400U    // Trip Input 11 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT12   0x800U    // Trip Input 12 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT14   0x2000U   // Trip Input 14 Select to CAPIN Mux
#define HRPWM_CAPINTRIPSEL_TRIPINPUT15   0x4000U   // Trip Input 15 Select to CAPIN Mux

//*************************************************************************************************
//
// The following are defines for the bit fields in the CAPTRIPSEL register
//
//*************************************************************************************************
#define HRPWM_CAPTRIPSEL_CAPINCOMPSEL_S     0U
#define HRPWM_CAPTRIPSEL_CAPINCOMPSEL_M     0xFU    // CAPIN Comparator Input Select
#define HRPWM_CAPTRIPSEL_CAPGATECOMPSEL_S   4U
#define HRPWM_CAPTRIPSEL_CAPGATECOMPSEL_M   0xF0U   // CAPGATE Comparator COMP Input Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMLOCK register
//
//*************************************************************************************************
#define HRPWM_EPWMLOCK_HRLOCK      0x1U          // HRPWM Register Set Lock
#define HRPWM_EPWMLOCK_GLLOCK      0x2U          // Global Load Register Set Lock
#define HRPWM_EPWMLOCK_TZCFGLOCK   0x4U          // TripZone Register Set Lock
#define HRPWM_EPWMLOCK_TZCLRLOCK   0x8U          // TripZone Clear Register Set Lock
#define HRPWM_EPWMLOCK_DCLOCK      0x10U         // Digital Compare Register Set Lock
#define HRPWM_EPWMLOCK_KEY_S       16U
#define HRPWM_EPWMLOCK_KEY_M       0xFFFF0000U   // Key to write to this register


//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMPCTL1 register
//
//*************************************************************************************************
#define HRPWM_XCMPCTL1_XCMPEN          0x1U     // XCMP Compare Register Operation Enable
#define HRPWM_XCMPCTL1_XCMPSPLIT       0x2U     // XCMP Register Allocation Options
#define HRPWM_XCMPCTL1_XCMPA_ALLOC_S   4U
#define HRPWM_XCMPCTL1_XCMPA_ALLOC_M   0xF0U    // XCMPn register allocation for CMPA
#define HRPWM_XCMPCTL1_XCMPB_ALLOC_S   8U
#define HRPWM_XCMPCTL1_XCMPB_ALLOC_M   0xF00U   // XCMPn register allocation for CMPB

//*************************************************************************************************
//
// The following are defines for the bit fields in the XLOADCTL register
//
//*************************************************************************************************
#define HRPWM_XLOADCTL_LOADMODE                    0x4U          // Load mode selection for Shadow
                                                                 // registers
#define HRPWM_XLOADCTL_SHDWLEVEL_S                 4U
#define HRPWM_XLOADCTL_SHDWLEVEL_M                 0x30U         // Shadow Register Level
                                                                 // Allocation Options
#define HRPWM_XLOADCTL_SHDWBUFPTR_LOADONCE_S       8U
#define HRPWM_XLOADCTL_SHDWBUFPTR_LOADONCE_M       0x300U        // Register Load event count
#define HRPWM_XLOADCTL_SHDWBUFPTR_LOADMULTIPLE_S   10U
#define HRPWM_XLOADCTL_SHDWBUFPTR_LOADMULTIPLE_M   0xC00U        // Register Load event count
#define HRPWM_XLOADCTL_RPTBUF2PRD_S                16U
#define HRPWM_XLOADCTL_RPTBUF2PRD_M                0x70000U      // Repeat Count Shadow Buffer 2
#define HRPWM_XLOADCTL_RPTBUF2CNT_S                20U
#define HRPWM_XLOADCTL_RPTBUF2CNT_M                0x700000U     // Repeat Count Status Shadow
                                                                 // Buffer 2
#define HRPWM_XLOADCTL_RPTBUF3PRD_S                24U
#define HRPWM_XLOADCTL_RPTBUF3PRD_M                0x7000000U    // Repeat Count Shadow Buffer 3
#define HRPWM_XLOADCTL_RPTBUF3CNT_S                28U
#define HRPWM_XLOADCTL_RPTBUF3CNT_M                0x70000000U   // Repeat Count Status Shadow
                                                                 // Buffer 3

//*************************************************************************************************
//
// The following are defines for the bit fields in the XLOAD register
//
//*************************************************************************************************
#define HRPWM_XLOAD_STARTLD   0x1U   // Enable register loading of shadow buffers
#define HRPWM_XLOAD_FRCLD     0x2U   // Force register loading of shadow buffers

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINKXLOAD register
//
//*************************************************************************************************
#define HRPWM_EPWMXLINKXLOAD_XLOADLINK_S   0U
#define HRPWM_EPWMXLINKXLOAD_XLOADLINK_M   0x1FU   // XLOAD  Link Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XREGSHDW1STS register
//
//*************************************************************************************************
#define HRPWM_XREGSHDW1STS_XCMP1_SHDW1FULL     0x1U      // XCMP1_SHDW1 register full Status flag
#define HRPWM_XREGSHDW1STS_XCMP2_SHDW1FULL     0x2U      // XCMP2_SHDW1 register full Status flag
#define HRPWM_XREGSHDW1STS_XCMP3_SHDW1FULL     0x4U      // XCMP3_SHDW1 register full Status flag
#define HRPWM_XREGSHDW1STS_XCMP4_SHDW1FULL     0x8U      // XCMP4_SHDW1 register full Status flag
#define HRPWM_XREGSHDW1STS_XCMP5_SHDW1FULL     0x10U     // XCMP5_SHDW1 register full Status flag
#define HRPWM_XREGSHDW1STS_XCMP6_SHDW1FULL     0x20U     // XCMP6_SHDW1 register full Status flag
#define HRPWM_XREGSHDW1STS_XCMP7_SHDW1FULL     0x40U     // XCMP7_SHDW1 register full Status flag
#define HRPWM_XREGSHDW1STS_XCMP8_SHDW1FULL     0x80U     // XCMP8_SHDW1 register full Status flag
#define HRPWM_XREGSHDW1STS_XTBPRD_SHDW1FULL    0x100U    // XTBPRD_SHDW1 register full Status flag:
#define HRPWM_XREGSHDW1STS_CMPC_SHDW1FULL      0x200U    // CMPC_SHDW1 register full Status flag:
#define HRPWM_XREGSHDW1STS_CMPD_SHDW1FULL      0x400U    // CMPD_SHDW1 register full Status flag:
#define HRPWM_XREGSHDW1STS_XAQCTLA_SHDW1FULL   0x800U    // XAQCTLA_SHDW1 register full Status
                                                         // flag:
#define HRPWM_XREGSHDW1STS_XAQCTLB_SHDW1FULL   0x1000U   // XAQCTLB_SHDW1 register full Status
                                                         // flag:
#define HRPWM_XREGSHDW1STS_XMAX_SHDW1FULL      0x2000U   // XMINMAX_SHDW1 register full Status
                                                         // flag:MAX field update
#define HRPWM_XREGSHDW1STS_XMIN_SHDW1FULL      0x4000U   // XMINMAX_SHDW1 register full Status
                                                         // flag: MIN field update

//*************************************************************************************************
//
// The following are defines for the bit fields in the XREGSHDW2STS register
//
//*************************************************************************************************
#define HRPWM_XREGSHDW2STS_XCMP1_SHDW2FULL     0x1U      // XCMP1_SHDW2 register full Status flag
#define HRPWM_XREGSHDW2STS_XCMP2_SHDW2FULL     0x2U      // XCMP2_SHDW2 register full Status flag
#define HRPWM_XREGSHDW2STS_XCMP3_SHDW2FULL     0x4U      // XCMP3_SHDW2 register full Status flag
#define HRPWM_XREGSHDW2STS_XCMP4_SHDW2FULL     0x8U      // XCMP4_SHDW2 register full Status flag
#define HRPWM_XREGSHDW2STS_XCMP5_SHDW2FULL     0x10U     // XCMP5_SHDW2 register full Status flag
#define HRPWM_XREGSHDW2STS_XCMP6_SHDW2FULL     0x20U     // XCMP6_SHDW2 register full Status flag
#define HRPWM_XREGSHDW2STS_XCMP7_SHDW2FULL     0x40U     // XCMP7_SHDW2 register full Status flag
#define HRPWM_XREGSHDW2STS_XCMP8_SHDW2FULL     0x80U     // XCMP8_SHDW2 register full Status flag
#define HRPWM_XREGSHDW2STS_XTBPRD_SHDW2FULL    0x100U    // XTBPRD_SHDW2 register full Status flag:
#define HRPWM_XREGSHDW2STS_CMPC_SHDW2FULL      0x200U    // CMPC_SHDW2 register full Status flag:
#define HRPWM_XREGSHDW2STS_CMPD_SHDW2FULL      0x400U    // CMPD_SHDW2 register full Status flag:
#define HRPWM_XREGSHDW2STS_XAQCTLA_SHDW2FULL   0x800U    // XAQCTLA_SHDW2 register full Status
                                                         // flag:
#define HRPWM_XREGSHDW2STS_XAQCTLB_SHDW2FULL   0x1000U   // XAQCTLB_SHDW2 register full Status
                                                         // flag:
#define HRPWM_XREGSHDW2STS_XMAX_SHDW2FULL      0x2000U   // XMINMAX_SHDW2 register full Status
                                                         // flag:MAX field update
#define HRPWM_XREGSHDW2STS_XMIN_SHDW2FULL      0x4000U   // XMINMAX_SHDW2 register full Status
                                                         // flag: MIN field update

//*************************************************************************************************
//
// The following are defines for the bit fields in the XREGSHDW3STS register
//
//*************************************************************************************************
#define HRPWM_XREGSHDW3STS_XCMP1_SHDW3FULL     0x1U      // XCMP1_SHDW3 register full Status flag
#define HRPWM_XREGSHDW3STS_XCMP2_SHDW3FULL     0x2U      // XCMP2_SHDW3 register full Status flag
#define HRPWM_XREGSHDW3STS_XCMP3_SHDW3FULL     0x4U      // XCMP3_SHDW3 register full Status flag
#define HRPWM_XREGSHDW3STS_XCMP4_SHDW3FULL     0x8U      // XCMP4_SHDW3 register full Status flag
#define HRPWM_XREGSHDW3STS_XCMP5_SHDW3FULL     0x10U     // XCMP5_SHDW3 register full Status flag
#define HRPWM_XREGSHDW3STS_XCMP6_SHDW3FULL     0x20U     // XCMP6_SHDW3 register full Status flag
#define HRPWM_XREGSHDW3STS_XCMP7_SHDW3FULL     0x40U     // XCMP7_SHDW3 register full Status flag
#define HRPWM_XREGSHDW3STS_XCMP8_SHDW3FULL     0x80U     // XCMP8_SHDW3 register full Status flag
#define HRPWM_XREGSHDW3STS_XTBPRD_SHDW3FULL    0x100U    // XTBPRD_SHDW3 register full Status flag:
#define HRPWM_XREGSHDW3STS_CMPC_SHDW3FULL      0x200U    // CMPC_SHDW3 register full Status flag:
#define HRPWM_XREGSHDW3STS_CMPD_SHDW3FULL      0x400U    // CMPD_SHDW3 register full Status flag:
#define HRPWM_XREGSHDW3STS_XAQCTLA_SHDW3FULL   0x800U    // XAQCTLA_SHDW3 register full Status
                                                         // flag:
#define HRPWM_XREGSHDW3STS_XAQCTLB_SHDW3FULL   0x1000U   // XAQCTLB_SHDW3 register full Status
                                                         // flag:
#define HRPWM_XREGSHDW3STS_XMAX_SHDW3FULL      0x2000U   // XMINMAX_SHDW3 register full Status
                                                         // flag:MAX field update
#define HRPWM_XREGSHDW3STS_XMIN_SHDW3FULL      0x4000U   // XMINMAX_SHDW3 register full Status
                                                         // flag: MIN field update

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP1_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_S   0U
#define HRPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_M   0xFFFFU       // Additional Compare 1 Active HR
                                                            // Register
#define HRPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_S     16U
#define HRPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_M     0xFFFF0000U   // Additional Compare 1 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP2_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_S   0U
#define HRPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_M   0xFFFFU       // Additional Compare 2 Active HR
                                                            // Register
#define HRPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_S     16U
#define HRPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_M     0xFFFF0000U   // Additional Compare 2 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP3_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_S   0U
#define HRPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_M   0xFFFFU       // Additional Compare 3 Active HR
                                                            // Register
#define HRPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_S     16U
#define HRPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_M     0xFFFF0000U   // Additional Compare 3 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP4_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_S   0U
#define HRPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_M   0xFFFFU       // Additional Compare 4 Active HR
                                                            // Register
#define HRPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_S     16U
#define HRPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_M     0xFFFF0000U   // Additional Compare 4 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP5_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_S   0U
#define HRPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_M   0xFFFFU       // Additional Compare 5 Active HR
                                                            // Register
#define HRPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_S     16U
#define HRPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_M     0xFFFF0000U   // Additional Compare 5 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP6_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XCMP6_ACTIVE_XCMP6HR_ACTIVE_S   0U
#define HRPWM_XCMP6_ACTIVE_XCMP6HR_ACTIVE_M   0xFFFFU       // Additional Compare 6 Active HR
                                                            // Register
#define HRPWM_XCMP6_ACTIVE_XCMP6_ACTIVE_S     16U
#define HRPWM_XCMP6_ACTIVE_XCMP6_ACTIVE_M     0xFFFF0000U   // Additional Compare 6 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP7_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XCMP7_ACTIVE_XCMP7HR_ACTIVE_S   0U
#define HRPWM_XCMP7_ACTIVE_XCMP7HR_ACTIVE_M   0xFFFFU       // Additional Compare 7 Active HR
                                                            // Register
#define HRPWM_XCMP7_ACTIVE_XCMP7_ACTIVE_S     16U
#define HRPWM_XCMP7_ACTIVE_XCMP7_ACTIVE_M     0xFFFF0000U   // Additional Compare 7 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP8_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XCMP8_ACTIVE_XCMP8HR_ACTIVE_S   0U
#define HRPWM_XCMP8_ACTIVE_XCMP8HR_ACTIVE_M   0xFFFFU       // Additional Compare 8 Active HR
                                                            // Register
#define HRPWM_XCMP8_ACTIVE_XCMP8_ACTIVE_S     16U
#define HRPWM_XCMP8_ACTIVE_XCMP8_ACTIVE_M     0xFFFF0000U   // Additional Compare 8 Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTBPRD_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XTBPRD_ACTIVE_XTBPRDHR_ACTIVE_S   0U
#define HRPWM_XTBPRD_ACTIVE_XTBPRDHR_ACTIVE_M   0xFFFFU       // Additional Time Base Period Active
                                                              // HR Register
#define HRPWM_XTBPRD_ACTIVE_XTBPRD_ACTIVE_S     16U
#define HRPWM_XTBPRD_ACTIVE_XTBPRD_ACTIVE_M     0xFFFF0000U   // Additional Time Base Period Active
                                                              // Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLA_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XAQCTLA_ACTIVE_XCMP1_S   0U
#define HRPWM_XAQCTLA_ACTIVE_XCMP1_M   0x3U      // XCMP1 Action
#define HRPWM_XAQCTLA_ACTIVE_XCMP2_S   2U
#define HRPWM_XAQCTLA_ACTIVE_XCMP2_M   0xCU      // XCMP2 Action
#define HRPWM_XAQCTLA_ACTIVE_XCMP3_S   4U
#define HRPWM_XAQCTLA_ACTIVE_XCMP3_M   0x30U     // XCMP3 Action
#define HRPWM_XAQCTLA_ACTIVE_XCMP4_S   6U
#define HRPWM_XAQCTLA_ACTIVE_XCMP4_M   0xC0U     // XCMP4 Action
#define HRPWM_XAQCTLA_ACTIVE_XCMP5_S   8U
#define HRPWM_XAQCTLA_ACTIVE_XCMP5_M   0x300U    // XCMP5 Action
#define HRPWM_XAQCTLA_ACTIVE_XCMP6_S   10U
#define HRPWM_XAQCTLA_ACTIVE_XCMP6_M   0xC00U    // XCMP6 Action
#define HRPWM_XAQCTLA_ACTIVE_XCMP7_S   12U
#define HRPWM_XAQCTLA_ACTIVE_XCMP7_M   0x3000U   // XCMP7 Action
#define HRPWM_XAQCTLA_ACTIVE_XCMP8_S   14U
#define HRPWM_XAQCTLA_ACTIVE_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLB_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XAQCTLB_ACTIVE_XCMP5_S   8U
#define HRPWM_XAQCTLB_ACTIVE_XCMP5_M   0x300U    // XCMP5 Action
#define HRPWM_XAQCTLB_ACTIVE_XCMP6_S   10U
#define HRPWM_XAQCTLB_ACTIVE_XCMP6_M   0xC00U    // XCMP6 Action
#define HRPWM_XAQCTLB_ACTIVE_XCMP7_S   12U
#define HRPWM_XAQCTLB_ACTIVE_XCMP7_M   0x3000U   // XCMP7 Action
#define HRPWM_XAQCTLB_ACTIVE_XCMP8_S   14U
#define HRPWM_XAQCTLB_ACTIVE_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XMINMAX_ACTIVE register
//
//*************************************************************************************************
#define HRPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_S   0U
#define HRPWM_XMINMAX_ACTIVE_XMAX_ACTIVE_M   0xFFFFU       // Maximum Valude  for Capture Counter
                                                           // Active Register
#define HRPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_S   16U
#define HRPWM_XMINMAX_ACTIVE_XMIN_ACTIVE_M   0xFFFF0000U   // Minimum Valude  for Capture Counter
                                                           // Active Register

