t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_hrpwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP1_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_S   0U
#define HRPWM_XCMP1_SHDW1_XCMP1HR_SHDW1_M   0xFFFFU       // Additional Compare 1 Shadow 1 HR
                                                          // Register
#define HRPWM_XCMP1_SHDW1_XCMP1_SHDW1_S     16U
#define HRPWM_XCMP1_SHDW1_XCMP1_SHDW1_M     0xFFFF0000U   // Additional Compare 1 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP2_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_S   0U
#define HRPWM_XCMP2_SHDW1_XCMP2HR_SHDW1_M   0xFFFFU       // Additional Compare 2 Shadow 1 HR
                                                          // Register
#define HRPWM_XCMP2_SHDW1_XCMP2_SHDW1_S     16U
#define HRPWM_XCMP2_SHDW1_XCMP2_SHDW1_M     0xFFFF0000U   // Additional Compare 2 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP3_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_S   0U
#define HRPWM_XCMP3_SHDW1_XCMP3HR_SHDW1_M   0xFFFFU       // Additional Compare 3 Shadow 1 HR
                                                          // Register
#define HRPWM_XCMP3_SHDW1_XCMP3_SHDW1_S     16U
#define HRPWM_XCMP3_SHDW1_XCMP3_SHDW1_M     0xFFFF0000U   // Additional Compare 3 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP4_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_S   0U
#define HRPWM_XCMP4_SHDW1_XCMP4HR_SHDW1_M   0xFFFFU       // Additional Compare 4 Shadow 1 HR
                                                          // Register
#define HRPWM_XCMP4_SHDW1_XCMP4_SHDW1_S     16U
#define HRPWM_XCMP4_SHDW1_XCMP4_SHDW1_M     0xFFFF0000U   // Additional Compare 4 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP5_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_S   0U
#define HRPWM_XCMP5_SHDW1_XCMP5HR_SHDW1_M   0xFFFFU       // Additional Compare 5 Shadow 1 HR
                                                          // Register
#define HRPWM_XCMP5_SHDW1_XCMP5_SHDW1_S     16U
#define HRPWM_XCMP5_SHDW1_XCMP5_SHDW1_M     0xFFFF0000U   // Additional Compare 5 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP6_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XCMP6_SHDW1_XCMP6HR_SHDW1_S   0U
#define HRPWM_XCMP6_SHDW1_XCMP6HR_SHDW1_M   0xFFFFU       // Additional Compare 6 Shadow 1 HR
                                                          // Register
#define HRPWM_XCMP6_SHDW1_XCMP6_SHDW1_S     16U
#define HRPWM_XCMP6_SHDW1_XCMP6_SHDW1_M     0xFFFF0000U   // Additional Compare 6 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP7_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XCMP7_SHDW1_XCMP7HR_SHDW1_S   0U
#define HRPWM_XCMP7_SHDW1_XCMP7HR_SHDW1_M   0xFFFFU       // Additional Compare 7 Shadow 1 HR
                                                          // Register
#define HRPWM_XCMP7_SHDW1_XCMP7_SHDW1_S     16U
#define HRPWM_XCMP7_SHDW1_XCMP7_SHDW1_M     0xFFFF0000U   // Additional Compare 7 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP8_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XCMP8_SHDW1_XCMP8HR_SHDW1_S   0U
#define HRPWM_XCMP8_SHDW1_XCMP8HR_SHDW1_M   0xFFFFU       // Additional Compare 8 Shadow 1 HR
                                                          // Register
#define HRPWM_XCMP8_SHDW1_XCMP8_SHDW1_S     16U
#define HRPWM_XCMP8_SHDW1_XCMP8_SHDW1_M     0xFFFF0000U   // Additional Compare 8 Shadow 1 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTBPRD_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XTBPRD_SHDW1_XTBPRDHR_SHDW1_S   0U
#define HRPWM_XTBPRD_SHDW1_XTBPRDHR_SHDW1_M   0xFFFFU       // Additional Time Base Period Shadow 1
                                                            // HR Register
#define HRPWM_XTBPRD_SHDW1_XTBPRD_SHDW1_S     16U
#define HRPWM_XTBPRD_SHDW1_XTBPRD_SHDW1_M     0xFFFF0000U   // Additional Time Base Period Shadow 1
                                                            // Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLA_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XAQCTLA_SHDW1_XCMP1_S   0U
#define HRPWM_XAQCTLA_SHDW1_XCMP1_M   0x3U      // XCMP1 Action
#define HRPWM_XAQCTLA_SHDW1_XCMP2_S   2U
#define HRPWM_XAQCTLA_SHDW1_XCMP2_M   0xCU      // XCMP2 Action
#define HRPWM_XAQCTLA_SHDW1_XCMP3_S   4U
#define HRPWM_XAQCTLA_SHDW1_XCMP3_M   0x30U     // XCMP3 Action
#define HRPWM_XAQCTLA_SHDW1_XCMP4_S   6U
#define HRPWM_XAQCTLA_SHDW1_XCMP4_M   0xC0U     // XCMP4 Action
#define HRPWM_XAQCTLA_SHDW1_XCMP5_S   8U
#define HRPWM_XAQCTLA_SHDW1_XCMP5_M   0x300U    // XCMP5 Action
#define HRPWM_XAQCTLA_SHDW1_XCMP6_S   10U
#define HRPWM_XAQCTLA_SHDW1_XCMP6_M   0xC00U    // XCMP6 Action
#define HRPWM_XAQCTLA_SHDW1_XCMP7_S   12U
#define HRPWM_XAQCTLA_SHDW1_XCMP7_M   0x3000U   // XCMP7 Action
#define HRPWM_XAQCTLA_SHDW1_XCMP8_S   14U
#define HRPWM_XAQCTLA_SHDW1_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLB_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XAQCTLB_SHDW1_XCMP5_S   8U
#define HRPWM_XAQCTLB_SHDW1_XCMP5_M   0x300U    // XCMP5 Action
#define HRPWM_XAQCTLB_SHDW1_XCMP6_S   10U
#define HRPWM_XAQCTLB_SHDW1_XCMP6_M   0xC00U    // XCMP6 Action
#define HRPWM_XAQCTLB_SHDW1_XCMP7_S   12U
#define HRPWM_XAQCTLB_SHDW1_XCMP7_M   0x3000U   // XCMP7 Action
#define HRPWM_XAQCTLB_SHDW1_XCMP8_S   14U
#define HRPWM_XAQCTLB_SHDW1_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XMINMAX_SHDW1 register
//
//*************************************************************************************************
#define HRPWM_XMINMAX_SHDW1_XMAX_SHDW1_S   0U
#define HRPWM_XMINMAX_SHDW1_XMAX_SHDW1_M   0xFFFFU       // Maximum Valude  for Capture Counter
                                                         // Active Register
#define HRPWM_XMINMAX_SHDW1_XMIN_SHDW1_S   16U
#define HRPWM_XMINMAX_SHDW1_XMIN_SHDW1_M   0xFFFF0000U   // Minimum Valude  for Capture Counter
                                                         // Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP1_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_S   0U
#define HRPWM_XCMP1_SHDW2_XCMP1HR_SHDW2_M   0xFFFFU       // Additional Compare 1 Shadow 2 HR
                                                          // Register
#define HRPWM_XCMP1_SHDW2_XCMP1_SHDW2_S     16U
#define HRPWM_XCMP1_SHDW2_XCMP1_SHDW2_M     0xFFFF0000U   // Additional Compare 1 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP2_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_S   0U
#define HRPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_M   0xFFFFU       // Additional Compare 2 Shadow 2 HR
                                                          // Register
#define HRPWM_XCMP2_SHDW2_XCMP2_SHDW2_S     16U
#define HRPWM_XCMP2_SHDW2_XCMP2_SHDW2_M     0xFFFF0000U   // Additional Compare 2 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP3_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_S   0U
#define HRPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_M   0xFFFFU       // Additional Compare 3 Shadow 2 HR
                                                          // Register
#define HRPWM_XCMP3_SHDW2_XCMP3_SHDW2_S     16U
#define HRPWM_XCMP3_SHDW2_XCMP3_SHDW2_M     0xFFFF0000U   // Additional Compare 3 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP4_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_S   0U
#define HRPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_M   0xFFFFU       // Additional Compare 4 Shadow 2 HR
                                                          // Register
#define HRPWM_XCMP4_SHDW2_XCMP4_SHDW2_S     16U
#define HRPWM_XCMP4_SHDW2_XCMP4_SHDW2_M     0xFFFF0000U   // Additional Compare 4 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP5_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_S   0U
#define HRPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_M   0xFFFFU       // Additional Compare 5 Shadow 2 HR
                                                          // Register
#define HRPWM_XCMP5_SHDW2_XCMP5_SHDW2_S     16U
#define HRPWM_XCMP5_SHDW2_XCMP5_SHDW2_M     0xFFFF0000U   // Additional Compare 5 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP6_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_S   0U
#define HRPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_M   0xFFFFU       // Additional Compare 6 Shadow 2 HR
                                                          // Register
#define HRPWM_XCMP6_SHDW2_XCMP6_SHDW2_S     16U
#define HRPWM_XCMP6_SHDW2_XCMP6_SHDW2_M     0xFFFF0000U   // Additional Compare 6 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP7_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_S   0U
#define HRPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_M   0xFFFFU       // Additional Compare 7 Shadow 2 HR
                                                          // Register
#define HRPWM_XCMP7_SHDW2_XCMP7_SHDW2_S     16U
#define HRPWM_XCMP7_SHDW2_XCMP7_SHDW2_M     0xFFFF0000U   // Additional Compare 7 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP8_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_S   0U
#define HRPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_M   0xFFFFU       // Additional Compare 8 Shadow 2 HR
                                                          // Register
#define HRPWM_XCMP8_SHDW2_XCMP8_SHDW2_S     16U
#define HRPWM_XCMP8_SHDW2_XCMP8_SHDW2_M     0xFFFF0000U   // Additional Compare 8 Shadow 2 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTBPRD_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_S   0U
#define HRPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_M   0xFFFFU       // Additional Time Base Period Shadow 1
                                                            // HR Register
#define HRPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_S     16U
#define HRPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_M     0xFFFF0000U   // Additional Time Base Period Shadow 1
                                                            // Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLA_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XAQCTLA_SHDW2_XCMP1_S   0U
#define HRPWM_XAQCTLA_SHDW2_XCMP1_M   0x3U      // XCMP1 Action
#define HRPWM_XAQCTLA_SHDW2_XCMP2_S   2U
#define HRPWM_XAQCTLA_SHDW2_XCMP2_M   0xCU      // XCMP2 Action
#define HRPWM_XAQCTLA_SHDW2_XCMP3_S   4U
#define HRPWM_XAQCTLA_SHDW2_XCMP3_M   0x30U     // XCMP3 Action
#define HRPWM_XAQCTLA_SHDW2_XCMP4_S   6U
#define HRPWM_XAQCTLA_SHDW2_XCMP4_M   0xC0U     // XCMP4 Action
#define HRPWM_XAQCTLA_SHDW2_XCMP5_S   8U
#define HRPWM_XAQCTLA_SHDW2_XCMP5_M   0x300U    // XCMP5 Action
#define HRPWM_XAQCTLA_SHDW2_XCMP6_S   10U
#define HRPWM_XAQCTLA_SHDW2_XCMP6_M   0xC00U    // XCMP6 Action
#define HRPWM_XAQCTLA_SHDW2_XCMP7_S   12U
#define HRPWM_XAQCTLA_SHDW2_XCMP7_M   0x3000U   // XCMP7 Action
#define HRPWM_XAQCTLA_SHDW2_XCMP8_S   14U
#define HRPWM_XAQCTLA_SHDW2_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLB_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XAQCTLB_SHDW2_XCMP5_S   8U
#define HRPWM_XAQCTLB_SHDW2_XCMP5_M   0x300U    // XCMP5 Action
#define HRPWM_XAQCTLB_SHDW2_XCMP6_S   10U
#define HRPWM_XAQCTLB_SHDW2_XCMP6_M   0xC00U    // XCMP6 Action
#define HRPWM_XAQCTLB_SHDW2_XCMP7_S   12U
#define HRPWM_XAQCTLB_SHDW2_XCMP7_M   0x3000U   // XCMP7 Action
#define HRPWM_XAQCTLB_SHDW2_XCMP8_S   14U
#define HRPWM_XAQCTLB_SHDW2_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XMINMAX_SHDW2 register
//
//*************************************************************************************************
#define HRPWM_XMINMAX_SHDW2_XMAX_SHDW2_S   0U
#define HRPWM_XMINMAX_SHDW2_XMAX_SHDW2_M   0xFFFFU       // Maximum Valude  for Capture Counter
                                                         // Active Register
#define HRPWM_XMINMAX_SHDW2_XMIN_SHDW2_S   16U
#define HRPWM_XMINMAX_SHDW2_XMIN_SHDW2_M   0xFFFF0000U   // Minimum Valude  for Capture Counter
                                                         // Active Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP1_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_S   0U
#define HRPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_M   0xFFFFU       // Additional Compare 1 Shadow 3 HR
                                                          // Register
#define HRPWM_XCMP1_SHDW3_XCMP1_SHDW3_S     16U
#define HRPWM_XCMP1_SHDW3_XCMP1_SHDW3_M     0xFFFF0000U   // Additional Compare 1 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP2_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_S   0U
#define HRPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_M   0xFFFFU       // Additional Compare 2 Shadow 3 HR
                                                          // Register
#define HRPWM_XCMP2_SHDW3_XCMP2_SHDW3_S     16U
#define HRPWM_XCMP2_SHDW3_XCMP2_SHDW3_M     0xFFFF0000U   // Additional Compare 2 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP3_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_S   0U
#define HRPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_M   0xFFFFU       // Additional Compare 3 Shadow 3 HR
                                                          // Register
#define HRPWM_XCMP3_SHDW3_XCMP3_SHDW3_S     16U
#define HRPWM_XCMP3_SHDW3_XCMP3_SHDW3_M     0xFFFF0000U   // Additional Compare 3 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP4_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XCMP4_SHDW3_XCMP4HR_SHDW3_S   0U
#define HRPWM_XCMP4_SHDW3_XCMP4HR_SHDW3_M   0xFFFFU       // Additional Compare 4 Shadow 3 HR
                                                          // Register
#define HRPWM_XCMP4_SHDW3_XCMP4_SHDW3_S     16U
#define HRPWM_XCMP4_SHDW3_XCMP4_SHDW3_M     0xFFFF0000U   // Additional Compare 4 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP5_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XCMP5_SHDW3_XCMP5HR_SHDW3_S   0U
#define HRPWM_XCMP5_SHDW3_XCMP5HR_SHDW3_M   0xFFFFU       // Additional Compare 5 Shadow 3 HR
                                                          // Register
#define HRPWM_XCMP5_SHDW3_XCMP5_SHDW3_S     16U
#define HRPWM_XCMP5_SHDW3_XCMP5_SHDW3_M     0xFFFF0000U   // Additional Compare 5 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP6_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XCMP6_SHDW3_XCMP6HR_SHDW3_S   0U
#define HRPWM_XCMP6_SHDW3_XCMP6HR_SHDW3_M   0xFFFFU       // Additional Compare 6 Shadow 3 HR
                                                          // Register
#define HRPWM_XCMP6_SHDW3_XCMP6_SHDW3_S     16U
#define HRPWM_XCMP6_SHDW3_XCMP6_SHDW3_M     0xFFFF0000U   // Additional Compare 6 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP7_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XCMP7_SHDW3_XCMP7HR_SHDW3_S   0U
#define HRPWM_XCMP7_SHDW3_XCMP7HR_SHDW3_M   0xFFFFU       // Additional Compare 7 Shadow 3 HR
                                                          // Register
#define HRPWM_XCMP7_SHDW3_XCMP7_SHDW3_S     16U
#define HRPWM_XCMP7_SHDW3_XCMP7_SHDW3_M     0xFFFF0000U   // Additional Compare 7 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCMP8_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XCMP8_SHDW3_XCMP8HR_SHDW3_S   0U
#define HRPWM_XCMP8_SHDW3_XCMP8HR_SHDW3_M   0xFFFFU       // Additional Compare 8 Shadow 3 HR
                                                          // Register
#define HRPWM_XCMP8_SHDW3_XCMP8_SHDW3_S     16U
#define HRPWM_XCMP8_SHDW3_XCMP8_SHDW3_M     0xFFFF0000U   // Additional Compare 8 Shadow 3 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTBPRD_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XTBPRD_SHDW3_XTBPRDHR_SHDW3_S   0U
#define HRPWM_XTBPRD_SHDW3_XTBPRDHR_SHDW3_M   0xFFFFU       // Additional Time Base Period Shadow 1
                                                            // HR Register
#define HRPWM_XTBPRD_SHDW3_XTBPRD_SHDW3_S     16U
#define HRPWM_XTBPRD_SHDW3_XTBPRD_SHDW3_M     0xFFFF0000U   // Additional Time Base Period Shadow 1
                                                            // Register

