t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_hrpwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLA_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XAQCTLA_SHDW3_XCMP1_S   0U
#define HRPWM_XAQCTLA_SHDW3_XCMP1_M   0x3U      // XCMP1 Action
#define HRPWM_XAQCTLA_SHDW3_XCMP2_S   2U
#define HRPWM_XAQCTLA_SHDW3_XCMP2_M   0xCU      // XCMP2 Action
#define HRPWM_XAQCTLA_SHDW3_XCMP3_S   4U
#define HRPWM_XAQCTLA_SHDW3_XCMP3_M   0x30U     // XCMP3 Action
#define HRPWM_XAQCTLA_SHDW3_XCMP4_S   6U
#define HRPWM_XAQCTLA_SHDW3_XCMP4_M   0xC0U     // XCMP4 Action
#define HRPWM_XAQCTLA_SHDW3_XCMP5_S   8U
#define HRPWM_XAQCTLA_SHDW3_XCMP5_M   0x300U    // XCMP5 Action
#define HRPWM_XAQCTLA_SHDW3_XCMP6_S   10U
#define HRPWM_XAQCTLA_SHDW3_XCMP6_M   0xC00U    // XCMP6 Action
#define HRPWM_XAQCTLA_SHDW3_XCMP7_S   12U
#define HRPWM_XAQCTLA_SHDW3_XCMP7_M   0x3000U   // XCMP7 Action
#define HRPWM_XAQCTLA_SHDW3_XCMP8_S   14U
#define HRPWM_XAQCTLA_SHDW3_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XAQCTLB_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XAQCTLB_SHDW3_XCMP5_S   8U
#define HRPWM_XAQCTLB_SHDW3_XCMP5_M   0x300U    // XCMP5 Action
#define HRPWM_XAQCTLB_SHDW3_XCMP6_S   10U
#define HRPWM_XAQCTLB_SHDW3_XCMP6_M   0xC00U    // XCMP6 Action
#define HRPWM_XAQCTLB_SHDW3_XCMP7_S   12U
#define HRPWM_XAQCTLB_SHDW3_XCMP7_M   0x3000U   // XCMP7 Action
#define HRPWM_XAQCTLB_SHDW3_XCMP8_S   14U
#define HRPWM_XAQCTLB_SHDW3_XCMP8_M   0xC000U   // XCMP8 Action

//*************************************************************************************************
//
// The following are defines for the bit fields in the XMINMAX_SHDW3 register
//
//*************************************************************************************************
#define HRPWM_XMINMAX_SHDW3_XMAX_SHDW3_S   0U
#define HRPWM_XMINMAX_SHDW3_XMAX_SHDW3_M   0xFFFFU       // Maximum Valude  for Capture Counter
                                                         // Active Register
#define HRPWM_XMINMAX_SHDW3_XMIN_SHDW3_S   16U
#define HRPWM_XMINMAX_SHDW3_XMIN_SHDW3_M   0xFFFF0000U   // Minimum Valude  for Capture Counter
                                                         // Active Register


//*************************************************************************************************
//
// The following are defines for the bit fields in the DECTL register
//
//*************************************************************************************************
#define HRPWM_DECTL_ENABLE         0x1U      // DE function enable.
#define HRPWM_DECTL_MODE           0x2U      // DE Mode
#define HRPWM_DECTL_REENTRYDLY_S   8U
#define HRPWM_DECTL_REENTRYDLY_M   0xFF00U   // Re-entry delay value

//*************************************************************************************************
//
// The following are defines for the bit fields in the DECOMPSEL register
//
//*************************************************************************************************
#define HRPWM_DECOMPSEL_TRIPL_S   0U
#define HRPWM_DECOMPSEL_TRIPL_M   0x3FU       // Comparator TRIPL source select.
#define HRPWM_DECOMPSEL_TRIPH_S   16U
#define HRPWM_DECOMPSEL_TRIPH_M   0x3F0000U   // Comparator TRIPH source select.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEACTCTL register
//
//*************************************************************************************************
#define HRPWM_DEACTCTL_PWMA_S       0U
#define HRPWM_DEACTCTL_PWMA_M       0x3U       // Comparator source select.
#define HRPWM_DEACTCTL_TRIPSELA     0x4U       // Trip source select on PWMA output
#define HRPWM_DEACTCTL_PWMB_S       4U
#define HRPWM_DEACTCTL_PWMB_M       0x30U      // Comparator source select.
#define HRPWM_DEACTCTL_TRIPSELB     0x40U      // Trip source select on PWMB output
#define HRPWM_DEACTCTL_TRIPENABLE   0x10000U   // Enables PWMTRIP condition to bypassDiode
                                               // emulation logic.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DESTS register
//
//*************************************************************************************************
#define HRPWM_DESTS_DEACTIVE   0x1U   // Diode Emulation mode active flag.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEFRC register
//
//*************************************************************************************************
#define HRPWM_DEFRC_DEACTIVE   0x1U   // Diode Emulation mode active flag force.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DECLR register
//
//*************************************************************************************************
#define HRPWM_DECLR_DEACTIVE   0x1U   // Diode Emulation mode active flag clear.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONCNT register
//
//*************************************************************************************************
#define HRPWM_DEMONCNT_CNT_S   0U
#define HRPWM_DEMONCNT_CNT_M   0xFFFFU   // DEACTIVE monitor counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONCTL register
//
//*************************************************************************************************
#define HRPWM_DEMONCTL_ENABLE   0x1U   // DEACTIVE monitor counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONSTEP register
//
//*************************************************************************************************
#define HRPWM_DEMONSTEP_INCSTEP_S   0U
#define HRPWM_DEMONSTEP_INCSTEP_M   0xFFU       // DE monitor counter increment step.
#define HRPWM_DEMONSTEP_DECSTEP_S   16U
#define HRPWM_DEMONSTEP_DECSTEP_M   0xFF0000U   // DE monitor counter decrement step.

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEMONTHRES register
//
//*************************************************************************************************
#define HRPWM_DEMONTHRES_THRESHOLD_S   0U
#define HRPWM_DEMONTHRES_THRESHOLD_M   0xFFFFU   // DE monitor counter compare threshold.


//*************************************************************************************************
//
// The following are defines for the bit fields in the MINDBCFG register
//
//*************************************************************************************************
#define HRPWM_MINDBCFG_ENABLEA     0x1U         // Minimum dead band logic enable on PWMA
#define HRPWM_MINDBCFG_INVERTA     0x4U         // Invert the selected reference signal on PWMA
#define HRPWM_MINDBCFG_SELBLOCKA   0x8U         // BLOCK signal source select on PWMA
#define HRPWM_MINDBCFG_SELA_S      4U
#define HRPWM_MINDBCFG_SELA_M      0xF0U        // Reference source select on PWMA min dead band
                                                // logic.
#define HRPWM_MINDBCFG_POLSELA     0x100U       // Select signal for the AND OR logic of PWMA
#define HRPWM_MINDBCFG_ENABLEB     0x10000U     // Minimum dead band logic enable on PWMB
#define HRPWM_MINDBCFG_INVERTB     0x40000U     // Invert the selected reference signal on PWMB
#define HRPWM_MINDBCFG_SELBLOCKB   0x80000U     // BLOCK signal source select on PWMB
#define HRPWM_MINDBCFG_SELB_S      20U
#define HRPWM_MINDBCFG_SELB_M      0xF00000U    // Reference source select on PWMB min dead band
                                                // logic.
#define HRPWM_MINDBCFG_POLSELB     0x1000000U   // Select signal for the AND OR logic of PWMB

//*************************************************************************************************
//
// The following are defines for the bit fields in the MINDBDLY register
//
//*************************************************************************************************
#define HRPWM_MINDBDLY_DELAYA_S   0U
#define HRPWM_MINDBDLY_DELAYA_M   0xFFFFU       // Minimum dead band delay on PWMA
#define HRPWM_MINDBDLY_DELAYB_S   16U
#define HRPWM_MINDBDLY_DELAYB_M   0xFFFF0000U   // Minimum dead band delay on PWMB

//*************************************************************************************************
//
// The following are defines for the bit fields in the LUTCTLA register
//
//*************************************************************************************************
#define HRPWM_LUTCTLA_BYPASS      0x1U        // Bypass LUTA
#define HRPWM_LUTCTLA_SELXBAR_S   4U
#define HRPWM_LUTCTLA_SELXBAR_M   0xF0U       // ICSS XBAR select
#define HRPWM_LUTCTLA_LUTDEC0     0x10000U    // LUT output PWMA value on decoding 0
#define HRPWM_LUTCTLA_LUTDEC1     0x20000U    // LUT output PWMA value on decoding 1
#define HRPWM_LUTCTLA_LUTDEC2     0x40000U    // LUT output PWMA value on decoding 2
#define HRPWM_LUTCTLA_LUTDEC3     0x80000U    // LUT output PWMA value on decoding 3
#define HRPWM_LUTCTLA_LUTDEC4     0x100000U   // LUT output PWMA value on decoding 4
#define HRPWM_LUTCTLA_LUTDEC5     0x200000U   // LUT output PWMA value on decoding 5
#define HRPWM_LUTCTLA_LUTDEC6     0x400000U   // LUT output PWMA value on decoding 6
#define HRPWM_LUTCTLA_LUTDEC7     0x800000U   // LUT output PWMA value on decoding 7

//*************************************************************************************************
//
// The following are defines for the bit fields in the LUTCTLB register
//
//*************************************************************************************************
#define HRPWM_LUTCTLB_BYPASS      0x1U        // Bypass LUTB
#define HRPWM_LUTCTLB_SELXBAR_S   4U
#define HRPWM_LUTCTLB_SELXBAR_M   0xF0U       // ICSS XBAR select
#define HRPWM_LUTCTLB_LUTDEC0     0x10000U    // LUT output PWMB value on decoding 0
#define HRPWM_LUTCTLB_LUTDEC1     0x20000U    // LUT output PWMB value on decoding 1
#define HRPWM_LUTCTLB_LUTDEC2     0x40000U    // LUT output PWMB value on decoding 2
#define HRPWM_LUTCTLB_LUTDEC3     0x80000U    // LUT output PWMB value on decoding 3
#define HRPWM_LUTCTLB_LUTDEC4     0x100000U   // LUT output PWMB value on decoding 4
#define HRPWM_LUTCTLB_LUTDEC5     0x200000U   // LUT output PWMB value on decoding 5
#define HRPWM_LUTCTLB_LUTDEC6     0x400000U   // LUT output PWMB value on decoding 6
#define HRPWM_LUTCTLB_LUTDEC7     0x800000U   // LUT output PWMB value on decoding 7



#endif
